app/views/emprestimos/new.html.erb

Lista de todos os filmes <br />
<% if @filme.emprestimos.exists and !@filme.emprestimos.blank? %>
---
SELECT "emprestimos".* FROM "emprestimos" WHERE "emprestimos"."filme_id" = 9
SELECT 1 AS one FROM "emprestimos" WHERE "emprestimos"."filme_id" = 9 LIMIT 1