app/views/usuarios/index.html.erb

   	<td><%= link_to usuario.codigo, :controller => :filmes, :action => :show, :id => usuario.id %></td>
		<% if usuario.cliente.blank? %>
---
SELECT "clientes".* FROM "clientes" WHERE "clientes"."usuario_id" = 1 LIMIT 1