app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cliente = Cliente.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "3"]]
---
  def new
		@usuario = Usuario.find(params[:id])

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @cliente = Cliente.find(params[:id])

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "clientes" ("cpf", "created_at", "endereco", "nascimento", "nome", "observacoes", "rg", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
		@usuario = Usuario.find(params[:id])
    @cliente = @usuario.create_cliente(params[:cliente])

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "clientes" SET "nome" = '', "endereco" = '', "cpf" = '', "rg" = '', "observacoes" = '', "nascimento" = '2013-03-06', "updated_at" = '2013-03-06 21:45:08.642716' WHERE "clientes"."id" = 6
---
  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])

SELECT "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 1]]
---
  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy