app/controllers/emprestimos_controller.rb

	def new
		@filme = Filme.find(params[:id])
		@usuario = Usuario.find(params[:ud])
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "11"]]

	def create
		@filme = Filme.find(params[:id])
		@usuario = Usuario.find(params[:ud])
		@emprestimo = @filme.emprestimos.build(params[:emprestimo])
		@emprestimo2 = @usuario.emprestimos.build( params[:emprestimo] )
		if @emprestimo.save && @emprestimo2.save
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "emprestimos" ("alugado", "created_at", "devolvido", "filme_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["alugado", Tue, 15 Jan 2008], ["created_at", Mon, 04 Mar 2013 02:41:04 UTC +00:00], ["devolvido", Tue, 15 Jan 2008], ["filme_id", 2], ["updated_at", Mon, 04 Mar 2013 02:41:04 UTC +00:00]]