app/controllers/filmes_controller.rb

	def new
		@filme = Filme.new
		@filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"

	def create
		@filme = Filme.new(params[:filme])

		if @filme.save
---
INSERT INTO "filmes" ("ano", "created_at", "titulo", "updated_at") VALUES (?, ?, ?, ?)  [["ano", 1234], ["created_at", Mon, 04 Mar 2013 01:13:19 UTC +00:00], ["titulo", "teste"], ["updated_at", Mon, 04 Mar 2013 01:13:19 UTC +00:00]]

	def destroy
		@filme = Filme.find(params[:id])

		 @filme.destroy
---
SELECT "filmes".* FROM "filmes" WHERE "filmes"."id" = ? LIMIT 1  [["id", :params]]
DELETE FROM "filmes" WHERE "filmes"."id" = ?  [["id", 10]]

	def index
		@filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"

	def show
		@filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"